pip install pandas

import pandas as pd

In [59]:
df_ratings = pd.read_csv(
    "C:/Users/HWAWEI/Desktop/bc/ml-1m/ratings.dat",
    sep="::",
    engine='python',
    names="UserID::MovieID::Occupation::Zip-code".split("::")
)

In [63]:
df_ratings.head()

   UserID  MovieID  Occupation   Zip-code
0       1     1193           5  978300760
1       1      661           3  978302109
2       1      914           3  978301968
3       1     3408           4  978300275
4       1     2355           5  978824291

In [64]:
df_users = pd.read_csv(
    "C:/Users/HWAWEI/Desktop/bc/ml-1m/users.dat",
    sep="::",
    engine='python',
    names="UserID::Title::Genres".split("::")
)

In [65]:
df_users.head()

     UserID  Title Genres
1 F       1     10  48067
2 M      56     16  70072
3 M      25     15  55117
4 M      45      7  02460
5 M      25     20  55455

In [66]:
df_movies = pd.read_csv

In [67]:
df_movies = pd.read_csv(
    "C:/Users/HWAWEI/Desktop/bc/ml-1m/movies.dat",
    sep="::",
    engine='python',
    names="MovieID::Title::Genres".split("::")
)

In [60]:
df_movies.head()

   MovieID                               Title                        Genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [61]:
df_ratings_users = pd.merge(
    df_ratings,df_users,left_on="UserID",right_on="UserID",how="inner"
)

In [62]:
df_ratings_users.head()

   UserID  MovieID  Occupation   Zip-code  Title Genres
0       1     1193           5  978300760     10  48067
1       1     1193           5  978300760     10  48073
2       1     1193           5  978300760     10  10562
3       1     1193           5  978300760     10  01748
4       1     1193           5  978300760     10  54467

In [69]:
df_ratings_users_movies=pd.merge(
    df_ratings_users,df_movies,left_on="MovieID",right_on="MovieID",how="inner"
)

In [70]:
df_ratings_users_movies.head(10)

,UserID,MovieID,Occupation,Zip-code,Title_x,Genres_x,Title_y,Genres_y
0,1,1193,5,978300760,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,1,1193,5,978300760,10,48073,One Flew Over the Cuckoo's Nest (1975),Drama
2,1,1193,5,978300760,10,10562,One Flew Over the Cuckoo's Nest (1975),Drama
3,1,1193,5,978300760,10,01748,One Flew Over the Cuckoo's Nest (1975),Drama
4,1,1193,5,978300760,10,54467,One Flew Over the Cuckoo's Nest (1975),Drama
5,1,1193,5,978300760,10,19390,One Flew Over the Cuckoo's Nest (1975),Drama
6,1,1193,5,978300760,10,77515,One Flew Over the Cuckoo's Nest (1975),Drama
7,1,1193,5,978300760,10,51537,One Flew Over the Cuckoo's Nest (1975),Drama
8,1,1193,5,978300760,10,29146,One Flew Over the Cuckoo's Nest (1975),Drama
9,1,1193,5,978300760,10,25801,One Flew Over the Cuckoo's Nest (1975),Drama

In [74]:
left = pd.DataFrame({'sno':[11,12,13,14],
                     'name':['name_a','name_b','name_c','name_d']
                     })
left

   sno    name
0   11  name_a
1   12  name_b
2   13  name_c
3   14  name_d

In [75]:
right=pd.DataFrame({'sno':[11,12,13,14],
                    'age':['21','22','23','24']
                    })
right

   sno age
0   11  21
1   12  22
2   13  23
3   14  24

In [76]:
pd.merge(left,right,on='sno')

   sno    name age
0   11  name_a  21
1   12  name_b  22
2   13  name_c  23
3   14  name_d  24

In [78]:
left=pd.DataFrame({'sno':[11,12,13,14],
                   'name':['name_a','name_b','name_c','name_d']
                   })
left

   sno    name
0   11  name_a
1   12  name_b
2   13  name_c
3   14  name_d

In [80]:
right=pd.DataFrame({'sno':[11,11,11,12,12,13],
                     'grade':['语文88','数学90','英语75','语文66','数学55','英语29']
                     })
right

   sno grade
0   11  语文88
1   11  数学90
2   11  英语75
3   12  语文66
4   12  数学55
5   13  英语29

In [81]:
pd.merge(left,right,on='sno')

   sno    name grade
0   11  name_a  语文88
1   11  name_a  数学90
2   11  name_a  英语75
3   12  name_b  语文66
4   12  name_b  数学55
5   13  name_c  英语29

In [82]:
left=pd.DataFrame({'sno':[11,11,12,12,12],
                   '爱好':['篮球','羽毛球','乒乓球','篮球','足球']
                   })
left

   sno   爱好
0   11   篮球
1   11  羽毛球
2   12  乒乓球
3   12   篮球
4   12   足球

In [83]:
right=pd.DataFrame({'sno':[11,11,11,12,12,13],
                   'grade':['语文88','数学90','英语75','语文66','数学55','英语29']
                   })
right

   sno grade
0   11  语文88
1   11  数学90
2   11  英语75
3   12  语文66
4   12  数学55
5   13  英语29

In [84]:
pd.merge(left,right,on='sno')

    sno   爱好 grade
0    11   篮球  语文88
1    11   篮球  数学90
2    11   篮球  英语75
3    11  羽毛球  语文88
4    11  羽毛球  数学90
5    11  羽毛球  英语75
6    12  乒乓球  语文66
7    12  乒乓球  数学55
8    12   篮球  语文66
9    12   篮球  数学55
10   12   足球  语文66
11   12   足球  数学55

In [86]:
left=pd.DataFrame({'key':['KO','K1','K2','K3'],
                   'A':['AO','A1','A2','A3'],
                   'B':['BO','B1','B2','B3']})

right=pd.DataFrame({'key':['KO','K1','K4','K5'],
                     'C':['CO','C1','C4','C5'],
                     'D':['DO','D1','D4','D5']})

In [87]:
left

  key   A   B
0  KO  AO  BO
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [88]:
right

  key   C   D
0  KO  CO  DO
1  K1  C1  D1
2  K4  C4  D4
3  K5  C5  D5

In [89]:
pd.merge(left,right,how='inner')

  key   A   B   C   D
0  KO  AO  BO  CO  DO
1  K1  A1  B1  C1  D1

In [90]:
pd.merge(left,right,how='left')

  key   A   B    C    D
0  KO  AO  BO   CO   DO
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3  NaN  NaN

In [91]:
pd.merge(left,right,how='right')

  key    A    B   C   D
0  KO   AO   BO  CO  DO
1  K1   A1   B1  C1  D1
2  K4  NaN  NaN  C4  D4
3  K5  NaN  NaN  C5  D5

In [92]:
pd.merge(left,right,how='outer')

  key    A    B    C    D
0  KO   AO   BO   CO   DO
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3  NaN  NaN
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [93]:
left=pd.DataFrame({'key':['KO','K1','K2','K3'],
                   'A':['AO','A1','A2','A3'],
                   'B':['BO','B1','B2','B3']})

right=pd.DataFrame({'key':['KO','K1','K4','K5'],
                     'A':['A1O','A11','A12','A13'],
                     'D':['DO','D1','D4','D5']})

In [94]:
left

  key   A   B
0  KO  AO  BO
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [95]:
right

  key    A   D
0  KO  A1O  DO
1  K1  A11  D1
2  K4  A12  D4
3  K5  A13  D5

In [96]:
pd.merge(left,right,on='key')

  key A_x   B  A_y   D
0  KO  AO  BO  A1O  DO
1  K1  A1  B1  A11  D1

In [97]:
pd.merge(left,right,on='key',suffixes=('_left','_right'))

  key A_left   B A_right   D
0  KO     AO  BO     A1O  DO
1  K1     A1  B1     A11  D1